[
    {
        "name": "OIT",
        "link": "https://oit.co",
        "logo": "/img/sponsors/OIT.webp",
        "description": "OIT, LLC is a service-first organization that specializes in telecommunications and distributed networking. Having started as a Managed Service Provider working with many clients from industries such as healthcare, manufacturing, retail and many more, they understand the unique needs of businesses and the IT firms that serve them."
    },
    {
        "name": "Genuine Technology Group",
        "link": "https://www.genuinetechnology.com/",
        "logo": "/img/sponsors/GenuineTechnologyGroup.png",
        "description": "Genuine Technology Group provides IT service the way it should be: simple, affordable, consistent and holistic."
    },
    {
        "name": "NinjaOne",
        "link": "https://www.ninjaone.com/",
        "logo": "/img/sponsors/NinjaOne.png",
        "description": "NinjaOne is committed to building high-performance, scalable, secure, and easy-to-use IT management products that monitor, remediate, and enable MSPs and IT professionals to deliver business continuity and drive profitability. Our user experience was designed from the ground up to lower the costs of onboarding new users and maximize automation to deliver a modern IT management experience."
    },
    {
        "name": "ImmyBot",
        "link": "https://immy.bot/",
        "logo": "/img/sponsors/ImmyBot.png",
        "description": ""
    },
    {
        "name": "Huntress",
        "link": "https://www.huntress.com/",
        "logo": "/img/sponsors/Huntress.png",
        "description": "Cybersecurity for the 99%. Huntress combines a powerful managed detection and response (MDR) platform with a team of human threat hunters—so you can protect your business from today’s determined cybercriminals."
    },
    {
        "name": "HaloPSA",
        "link": "https://www.HaloPSA.com/",
        "logo": "/img/sponsors/HaloPSA.svg",
        "description": "All-in-One PSA Software for Service Providers"
    }
]